export const FINA_BASE_TIMES = {
  LCM: {
    Female: {
      '50公尺自由式': 23.61,
      '100公尺自由式': 51.71,
      '200公尺自由式': 112.23,
      '400公尺自由式': 234.18,
      '50公尺仰式': 26.86,
      '100公尺仰式': 57.13,
      '200公尺仰式': 123.14,
      '50公尺蛙式': 29.16,
      '100公尺蛙式': 64.13,
      '200公尺蛙式': 137.55,
      '50公尺蝶式': 24.43,
      '100公尺蝶式': 54.60,
      '200公尺蝶式': 121.81,
      '200公尺混合式': 125.70,
      '400公尺混合式': 263.65,
    },
    Male: {
      '50公尺自由式': 20.91,
      '100公尺自由式': 46.40,
      '200公尺自由式': 102.00,
      '400公尺自由式': 219.96,
      '50公尺仰式': 23.55,
      '100公尺仰式': 51.60,
      '200公尺仰式': 111.92,
      '50公尺蛙式': 25.95,
      '100公尺蛙式': 56.88,
      '200公尺蛙式': 125.48,
      '50公尺蝶式': 22.27,
      '100公尺蝶式': 49.45,
      '200公尺蝶式': 110.34,
      '200公尺混合式': 112.69,
      '400公尺混合式': 242.50,
    },
  },
} as const;

export type FinaPoolCourse = keyof typeof FINA_BASE_TIMES;
export type FinaGender = keyof typeof FINA_BASE_TIMES.LCM;
export type FinaEvent = keyof typeof FINA_BASE_TIMES.LCM.Female;
